server/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("description", "notes", "state", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "adadasd"], ["notes", "dsadasdad"], ["state", "borrowed"], ["friend_id", 3], ["created_at", "2015-11-29 17:29:30.703410"], ["updated_at", "2015-11-29 17:29:30.703410"]]