server/app/controllers/friends_controller.rb

INSERT INTO "friends" ("first_name", "last_name", "email", "twitter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "dfdf"], ["last_name", "dffdsd"], ["email", "sdffd"], ["twitter", "sdfdsfsd"], ["created_at", "2015-11-24 08:22:23.304919"], ["updated_at", "2015-11-24 08:22:23.304919"]]
---
  def create
    @friend = Friend.new(friend_params)

    if @friend.save

SELECT  "friends".* FROM "friends" WHERE "friends"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "friends" SET "email" = $1, "updated_at" = $2 WHERE "friends"."id" = $3  [["email", "savani@gmail.com"], ["updated_at", "2015-11-24 12:37:24.207745"], ["id", 1]]
---
  def update
    @friend = Friend.find(params[:id])

    if @friend.update(friend_params)